LoadTesting/Transworld-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Transworld-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Transworld-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Transworld-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1280,563)
      - go(chrome://newtab/)
      - go(http://api.demo.hidayahsmart.solutions/docs)
      - clickByCSS(button.opblock-control-arrow)
      - clickByXPath(//*[text() = "Try it out"])
      - clickByXPath(//*[text() = "Execute"])

  Transworld-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://api.demo.hidayahsmart.solutions/docs'
            method: GET
            label: 'http://api.demo.hidayahsmart.solutions/docs'
            think-time: 0ms
            headers: {}